Repository: chabulhwi/tpil-solutions
Catalog: docs/omegat/project_save.tmx
Source language: en
Languages: ko

source: (False.elim, also known as ex falso quodlibet (EFQ) or the principle of explosion)
ko: [False.elim, 엑스 팔소 세퀴투르 쿠오들리베트(ex falso quodlibet, EFQ) 또는 폭발 원리]

source: (True.intro, or more commonly, trivial)
ko: (True.intro 또는 trivial)

source: (Iff.mp, modus ponens for iff)
ko: (Iff.mp, 동등에 대한 긍정 논법)

source: (Iff.mpr, reversed modus ponens for iff)
ko: (Iff.mpr, 동등에 대한 역방향 긍정 논법)

source: (refutation by contradiction)
ko: (모순에 따른 부인)

source: (existential elimination)
ko: (존재 제거)

source: (existential introduction)
ko: (존재 도입)

source: (modus ponens)
ko: (긍정 논법[모더스 포넨스])

source: (universal generalization)
ko: (보편 일반화)

source: (universal instantiation)
ko: (보편 예시)

source: (Or.elim, also known as proof by cases)
ko: (Or.elim, 경우에 따른 증명)

source: (ibid.)
ko: (같은 문서 항목)

source: Exam: My additional examinations for the text.
ko: Exam: 제가 추가로 만든 교재 시험 문제.

source: TPIL: My solutions to the exercises and questions.
ko: TPIL: 연습 문제와 퀴즈 문항의 제 풀이.

source: docs: Markdown documents including notes and quizzes.
ko: docs: 보충 학습 자료와 퀴즈를 포함한 마크다운 문서.

source: en: Source documents written in English.
ko: en: 영어로 작성한 원문.

source: ko: Korean translation of the source documents in the en directory.
ko: ko: en 디렉터리에 있는 원문을 한국어로 번역한 문서.

source: ChapterXX: Chapter XX of the text.
ko: ChapterXX: 교재 XX장.

source: ChapterXX: My notes about the concepts explained in Chapter XX of the text.
ko: ChapterXX: 교재의 XX장에서 설명된 개념에 관한 제 보충 학습 자료.

source: Exercise*: Solutions to the exercise(s) in the chapter.
ko: Exercise*: 교재 XX장의 연습 문제 풀이.

source: Question*: Solutions to the question(s) of my quiz.
ko: Question*: 제 퀴즈 문항의 풀이.

source: chapterXX.md: My additional quiz for Chapter XX of the text.
ko: chapterXX.md: 교재의 XX장을 학습자가 잘 이해했는지 확인하려고 제가 만든 퀴즈.

source: p → q follows from p ↔ q.
ko: p ↔ q에서 p → q가 도출된다.

source: p ∨ q follows from p.
ko: p에서 p ∨ q가 도출된다.

source: p ∨ q follows from q.
ko: q에서 p ∨ q가 도출된다.

source: p follows from p ∧ q.
ko: p ∧ q에서 p가 도출된다.

source: q → p follows from p ↔ q.
ko: p ↔ q에서 q → p가 도출된다.

source: q follows from p ∧ q.
ko: p ∧ q에서 q가 도출된다.

source: \(b\) At least one of them is a dependent function.
ko: \(b\) 이 상수들 중 적어도 하나는 의존 함수이다.

source: \(b\) It is a dependent function.
ko: \(b\) 이 함수는 의존 함수이다.

source: \(b\) It is parametrically polymorphic.
ko: \(b\) 이 함수는 매개 변수 다형적이다.

source: \(b\) The less-than-or-equal-to relation on natural numbers, · ≤ · : Nat → Nat → Prop, is an equivalence relation.
ko: \(b\) 자연수에 대한 작거나 같음 관계 · ≤ · : Nat → Nat → Prop는 동치 관계이다.

source: \(b\) The term p is a true proposition.
ko: \(b\) 항 p는 참인 명제이다.

source: \(b\) The type p → q is an implication.
ko: \(b\) 유형 p → q는 함의이다.

source: \(b\) What are the constructors and recursor of the Bool type?
ko: \(b\) Bool 유형의 구성자와 재귀자는 무엇인가?

source: \(c\) At least one of them has a dependent function type.
ko: \(c\) 이 상수들 중 적어도 하나는 의존 함수형에 속한다.

source: \(c\) It has a dependent function type.
ko: \(c\) 이 함수는 의존 함수형에 속한다.

source: \(c\) It is a dependent function.
ko: \(c\) 이 함수는 의존 함수이다.

source: \(b\) The term t is a function from p to False.
ko: \(b\) 항 t는 p에서 False로의 함수이다.

source: \(d\) At least one of them is a dependent pair.
ko: \(d\) 이 상수들 중 적어도 하나는 의존 순서쌍이다.

source: \(d\) At least one of them is a dependent product.
ko: \(d\) 이 상수들 중 적어도 하나는 의존곱이다.

source: \(d\) It has a dependent function type.
ko: \(d\) 이 함수는 의존 함수형에 속한다.

source: \(c\) The term t is a function from p to q.
ko: \(c\) 항 t는 p에서 q로의 함수이다.

source: \(c\) The term t is a proof of some proposition.
ko: \(c\) 항 t는 어떤 명제의 증명이다.

source: \(e\) At least one of them has a dependent product type.
ko: \(e\) 이 상수들 중 적어도 하나는 의존곱형에 속한다.

source: \(c\) The term t is a proof of ¬p, the negation of p.
ko: \(c\) 항 t는 p의 부정 ¬p의 증명이다.

source: \(d\) The term t is a proof of the proposition p → q.
ko: \(d\) 항 t는 명제 p → q의 증명이다.

source: Answer by true or false each of the following statements about equivalence relations.
ko: 동치 관계에 대한 다음 진술이 참인지 거짓인지 각각 판단하라.

source: Answer by true or false each of the following statements about the constants you defined in Question 9.
ko: [문제 9](#문제-9)에서 정의된 상수들에 대한 다음 진술이 참인지 거짓인지 각각 판단하라.

source: Answer by true or false each of the following statements about the function Type.id from Question 8.
ko: [문제 8](#문제-8)의 함수 Type.id에 대한 다음 진술이 참인지 거짓인지 각각 판단하라.

source: Answer by true or false each of the following statements about the function Type.id of Question 8.
ko: [문제 8](#문제-8)의 함수 Type.id에 대한 다음 진술이 참인지 거짓인지 각각 판단하라.

source: Answer by true or false each of the following statements about the terms p : Prop and t : p.
ko: 두 항 p : Prop와 t : p에 대한 다음 진술이 참인지 거짓인지 각각 판단하라.

source: Answer by true or false each of the following statements about the terms p : Prop and t : ¬p.
ko: 두 항 p : Prop와 t : ¬p에 대한 다음 진술이 참인지 거짓인지 각각 판단하라.

source: Answer by true or false each of the following statements about the terms p q : Prop and t : p → q.
ko: 두 항 p q : Prop와 t : p → q에 대한 다음 진술이 참인지 거짓인지 각각 판단하라.

source: Appendix: Korean High School Mathematics Teachers' Thoughts
ko: 부록: 한국 고등학교 수학 교사들의 생각

source: Are the constants you defined in Question 9 universe-polymorphic?
ko: [문제 9](#문제-9)에서 정의된 상수들은 세계 다형적인가?

source: Are the following functions alpha-equivalent?
ko: 다음 함수들은 알파 동등한가?

source: Are the types from Question 29 and Question 30 the same?
ko: [문제 29](#문제-29)와 [문제 30](#문제-30)에 나온 두 유형은 서로 같은가?

source: Are the types of Question 29 and Question 30 the same?
ko: [문제 29](#문제-29)와 [문제 30](#문제-30)에 나온 두 유형은 서로 같은가?

source: Both responded that (a) isn't a proposition.
ko: 두 분 모두 (1)은 명제가 아니라고 답했습니다.

source: Chapter 2 Quiz
ko: 2장 퀴즈

source: Chapter 3 Quiz
ko: 3장 퀴즈

source: Chapter 4 Quiz
ko: 4장 퀴즈

source: Chapter 7 Quiz
ko: 7장 퀴즈

source: Conjunction
ko: 연언

source: Contraposition: ¬q → ¬p is the contraposition of p → q.
ko: 대우(對偶): ¬q → ¬p는 p → q의 대우이다.

source: Contraposition: ¬q → ¬p is the contraposition of the implication p → q.
ko: 대우(對偶): ¬q → ¬p는 함의 p → q의 대우이다.

source: Contributing
ko: 기여하기

source: Conversion: q → p is the converse of p → q.
ko: 역: q → p는 p → q의 역이다.

source: Conversion: q → p is the converse of the implication p → q.
ko: 역: q → p는 함의 p → q의 역이다.

source: Define a constant of each type listed below.
ko: 아래의 유형에 속하는 상수를 각각 정의하라.

source: Define a function that takes a natural number as input and returns true if the number is non-zero and false if the number is zero.
ko: 자연수를 입력값으로 받아, 그 수가 영이 아니면 true를 반환하고, 그 수가 영이면 false를 반환하는 함수를 정의하라.

source: Define a function that takes two natural numbers as input arguments and returns the one less than or equal to the other.
ko: 두 자연수를 입력값으로 받아, 둘 중에서 다른 것보다 작거나 그것과 같은 자연수를 반환하는 함수를 정의하라.

source: Define an element of BinaryTree that corresponds to the above ASCII art:
ko: 위의 아스키 아트에 대응하는 BinaryTree의 원소를 정의하라.

source: Define an element of FinTree Nat that corresponds to the above ASCII art:
ko: 위의 아스키 아트에 대응하는 FinTree Nat의 원소를 정의하라.

source: Define boolean operations and, or, not on the Bool type, and verify the two identities listed below:
ko: Bool 유형에 대한 불 연산 and, or, not을 정의하고, 아래 나열된 두 항등식을 검증하라.

source: Define the following function, replacing the sorry identifier with an actual expression containing the arguments f, g, and s.
ko: sorry 식별자를 실제 식으로 바꿔 다음 함수를 정의하라. 그 식은 세 인수 f, g, s를 포함해야 한다.

source: Define the following two functions, DayOrEnd and listDayOrEnd, which are within the DayOfWeek namespace:
ko: DayOfWeek 이름 공간 안의 두 함수 DayOrEnd와 listDayOrEnd를 정의하라.

source: Define the following two universe-polymorphic functions, replacing each sorry identifier with an actual definition.
ko: 각 sorry 식별자를 실제 정의로 바꿔 다음의 두 세계 다형적 함수를 정의하라.

source: Definition in Lean: ¬p is defined to be p → False.
ko: 린에서의 정의: ¬p는 p → False로 정의된다.

source: Definition in Lean: if p is an arbitrary expression, ∀ (x : α), p is an alternative notation for (x : α) → p.
ko: 린에서의 정의: p가 임의의 식이면, ∀ (x : α), p는 (x : α) → p의 다른 표기법이다.

source: Develop a notion of composition for partial functions from α to β and β to γ, and show that it behaves as expected.
ko: α에서 β로의 그리고 β에서 γ로의 부분 함수의 합성 개념을 정의하라. 그러고 나서, 이 개념이 우리가 예상한 대로 작동함을 보여라.

source: Directories and files
ko: 디렉터리와 파일

source: Disjunction
ko: 선언

source: E.g., if the proposition that a loves b is the ordered triple <loving, a, b>, it is distinct from the proposition that b loves a, which would be the ordered triple <loving, b, a>.
ko: 예를 들어, a가 b를 사랑한다는 명제가 순서세짝 <사랑함, a, b>라면, b가 a를 사랑한다는 명제는 순서세짝 <사랑함, b, a>가 될 것이고, 이 두 명제는 별개이다.

source: Editor shortcut: \and
ko: 편집기 단축키: \and

source: Editor shortcut: \ex, \exists
ko: 편집기 단축키: \ex, \exists

source: Editor shortcut: \forall
ko: 편집기 단축키: \forall

source: Editor shortcut: \iff, \lr
ko: 편집기 단축키: \iff, \lr

# Editor shortcut: ot, eg
source: Editor shortcut: \not, \neg
ko: 편집기 단축키: \not, \neg

source: Editor shortcut: \or
ko: 편집기 단축키: \or

# Editor shortcut: o, , imp
source: Editor shortcut: \to, \r, \imp
ko: 편집기 단축키: \to, \r, \imp

source: Elimination rule: q follows from p and p → q.
ko: 제거 규칙: p와 p → q에서 q가 도출된다.

source: Elimination rule: q follows from ∃ (x : α), p x and ∀ (a : α), p a → q.
ko: 제거 규칙: ∃ (x : α), p x와 ∀ (a : α), p a → q에서 q가 도출된다.

source: Elimination rule: r follows from p ∨ q, p → r, and q → r.
ko: 제거 규칙: p ∨ q, p → r, q → r에서 r가 도출된다.

source: Elimination rule: a contradiction follows from p and ¬p.
ko: 제거 규칙: p와 ¬p에서 모순이 도출된다.

source: Elimination rule: any proposition follows from a contradiction.
ko: 제거 규칙: 모순에서 임의의 명제가 도출된다.

source: Elimination rule: given a : α, p a follows from ∀ (x : α), p x.
ko: 제거 규칙: a : α가 주어져 있을 때, ∀ (x : α), p x에서 p a가 도출된다.

source: Elimination rules
ko: 제거 규칙

source: English | 한국어[Korean]
ko: [English (영어)](./README.md) | 한국어

source: Equivalence
ko: 동등

source: Existential Quantifiers
ko: 존재 정량어

source: Falsity
ko: 거짓

source: Fix the definition of the dependent function f.
ko: 의존 함수 f의 정의를 고쳐라.

source: Fix the expression after the #eval command to evaluate it.
ko: #eval 명령어 뒤의 식을 고쳐 그 값을 계산하라.

source: Fix the expression after the last #eval command by providing the missing arguments to the function compose.
ko: 마지막 #eval 명령어 뒤의 식에, 함수 compose의 인수 중 빠진 것을 넣어 그 식을 고쳐라.

source: For information about Empty.elim, see .
ko: Empty.elim에 관한 정보는 다음 문서에서 확인할 수 있다.

source: For information about parametric polymorphism, see .
ko: 매개 변수 다형성에 관한 정보는 다음 문서에서 확인할 수 있다.

source: For information about parametric polymorphism, see https://ncatlab.org/nlab/show/polymorphism#parametric_polymorphism.
ko: 매개 변수 다형성에 관한 정보는 다음 문서에서 확인할 수 있다. https://ncatlab.org/nlab/show/polymorphism#parametric_polymorphism

source: For information about the polymorphic product type PProd, see .
ko: 다형적 곱유형 PProd에 관한 정보는 다음 문서에서 확인할 수 있다.

source: For information about the polymorphic sum type PSum, see .
ko: 다형적 합유형 PSum에 관한 정보는 다음 문서에서 확인할 수 있다.

source: For information about the polymorphic type of dependent pairs PSigma, see .
ko: 다형적 의존곱형 PSigma에 관한 정보는 다음 문서에서 확인할 수 있다.

source: Give an example of a function that takes one or more implicit arguments.
ko: 암시적 인수를 하나 이상 받는 함수의 예를 들라.

source: Give an example of a term of each type listed below.
ko: 아래에 나열된 유형에 속하는 항의 보기를 각각 들어라.

source: Give an example of a term of each type listed below:
ko: 아래에 나열된 유형에 속하는 항의 보기를 각각 들어라.

source: Give an example of a term of the following type:
ko: 다음 유형에 속하는 항의 보기를 들어라.

source: Give the type of each expression listed below.
ko: 아래에 나열된 식의 유형을 각각 구하라.

source: Give the type of the expression Type.id Nat.
ko: 식 Type.id Nat의 유형을 구하라.

source: Give the value and type of each expression listed below.
ko: 아래에 나열된 식의 값과 유형을 각각 구하라.

source: Give the value of each expression listed below.
ko: 아래에 나열된 식의 값을 각각 구하라.

source: Give the value of each of the following expressions, where f is the function defined in Question 34.
ko: 다음 식의 값을 각각 구하라. 여기서 f는 [문제 34](#문제-34)에서 정의된 함수이다.

source: Give the value of the expression (λ x : Int => -x + 2) 3.
ko: 식 (λ x : Int => -x + 2) 3의 값을 구하라.

source: Given α : Type and β : α → Type, is the type (a : α) × β a a dependent product type?
ko: 유형 α : Type와 β : α → Type가 주어져 있을 때, 유형 (a : α) × β a는 의존곱형인가?

source: Given α : Type and β : α → Type, is the type (a : α) → β a a dependent function type?
ko: 유형 α : Type와 β : α → Type가 주어져 있을 때, 유형 (a : α) → β a는 의존 함수형인가?

source: Given α : Type and β : α → Type, is the type Σ (a : α), β a a sigma type?
ko: 유형 α : Type와 β : α → Type가 주어져 있을 때, 유형 Σ (a : α), β a는 시그마형인가?

source: Goldbach's conjecture states that every even natural number greater than 2 is the sum of two prime numbers.
ko: 골드바흐의 추측은 2보다 큰 모든 짝수가 두 소수의 합이라는 진술입니다.

source: High school mathematics teachers in South Korea would answer no.
ko: 한국의 고등학교 수학 교사들은 그렇지 않다고 답할 것입니다.

source: However, the conjecture can be defined as a proposition in the Lean theorem prover as follows:
ko: 그러나 이 추측은 린 정리 증명기를 이용해 다음 명제로 정의할 수 있습니다.

source: However, they were divided on whether (b) is a proposition.
ko: 그러나 (2)가 명제인지를 둘러싸고 두 분의 의견이 갈렸습니다.

source: However, this repository also contains a Lean file in the public domain.
ko: 그러나 이 저장소에는 자유 이용 저작물인 린 파일도 있습니다.

source: I don't think the usage of the term 'proposition' in Korean high school mathematics coincides with those in contemporary philosophy or interactive theorem provers like Lean.
ko: 저는 한국 고등학교 수학에서 '명제' 용어가 쓰이는 방법이 동시대 철학에서의 용법이나 린 같은 상호 작용 정리 증명기에서의 용법과 일치한다고 생각하지 않습니다.

source: I use OmegaT to translate English documentation into Korean.
ko: 오메가T(OmegaT)를 이용해 영어 문서를 한국어로 번역했습니다.

source: I've also included a quiz for each chapter of the text in this repository, along with my solutions to the questions in each quiz.
ko: 교재 각 장의 퀴즈와 제 풀이도 이 저장소에 포함했습니다.

source: I've also included additional quizzes and examinations in this repository, along with my solutions to the questions in each quiz.
ko: 퀴즈와 시험도 이 저장소에 포함했고, 각 퀴즈의 문제 풀이도 있습니다.

source: If you've found errors in my solutions and want to fix them, please send an email to .
ko: 제 풀이에 있는 오류를 고치고 싶다면, 에 전자 우편을 보내 주세요.

source: Implication
ko: 함의

source: In the following paragraph, what do the noun phrases "the latter" and "it", enclosed in square brackets, refer to?
ko: 다음 문단에서, 대괄호로 묶인 명사구 'the latter'와 'it'은 무엇을 가리키는가?

source: Introduction rule: True is true.
ko: 도입 규칙: True는 참이다.

source: Introduction rule: p ↔ q follows from p → q and q → p.
ko: 도입 규칙: p → q와 q → p에서 p ↔ q가 도출된다.

source: Introduction rule: p ∧ q follows from p and q.
ko: 도입 규칙: p와 q에서 p ∧ q가 도출된다.

source: Introduction rule: given a : α, ∃ (x : α), p x follows from p a.
ko: 도입 규칙: a : α가 주어져 있을 때, p a에서 ∃ (x : α), p x가 도출된다.

source: Introduction rule: if p x holds for every term x : α, then ∀ (x : α), p x holds.
ko: 도입 규칙: 각각의 항 x : α에 대해 p x가 성립하면, ∀ (x : α), p x가 성립한다.

source: Introduction rule: if q follows from p, then p → q holds.
ko: 도입 규칙: p에서 q가 도출되면, p → q가 성립한다.

source: Introduction rule: if a contradiction follows from p, then ¬p holds.
ko: 도입 규칙: p에서 모순이 도출되면, ¬p가 성립한다.

source: Introduction rules
ko: 도입 규칙

source: Inversion: ¬p → ¬q is the inverse of p → q.
ko: 이(裏): ¬p → ¬q는 p → q의 이이다.

source: Inversion: ¬p → ¬q is the inverse of the implication p → q.
ko: 이(裏): ¬p → ¬q는 함의 p → q의 이이다.

source: Is Goldbach's Conjecture a Proposition?
ko: 골드바흐의 추측은 명제인가?

source: Is a Conjecture in Mathematics a Proposition?
ko: 수학 분야에서의 추측은 명제인가?

source: Is the Sentence 'Bulhwi Cha loves himself' a Proposition?
ko: 문장 '차불휘는 자기 자신을 사랑한다.'는 명제인가?

source: Is the definition of the predicate p from Question 1 impredicative?
ko: [문제 1](#문제-1)에 나온 술어 p의 정의는 비서술적인가?

source: Is the expression fun x : Nat ↦ 0 the identity function on Nat?
ko: 식 fun x : Nat ↦ 0은 Nat에 대한 항등 함수인가?

source: Is the expression fun x : Nat ↦ x a constant function?
ko: 식 fun x : Nat ↦ x는 상수 함수인가?

source: Is the function Type.id from Question 8 universe-polymorphic?
ko: [문제 8](#문제-8)의 함수 Type.id는 세계 다형적인가?

source: Is the function Type.id of Question 8 universe-polymorphic?
ko: [문제 8](#문제-8)의 함수 Type.id는 세계 다형적인가?

source: Is the proposition that John loves Mary different from the proposition that Mary is loved by John?
ko: 존이 매리를 사랑한다는 명제는 매리가 존의 사랑을 받는다는 명제와 다른가?

source: Is the type (α : Type) × Prop a dependent product type?
ko: 유형 (α : Type) × Prop은 의존곱형인가?

source: Is the type (α : Type) → (β : α → Type) → (a : α) × β a a dependent product type?
ko: 유형 (α : Type) → (β : α → Type) → (a : α) × β a는 의존곱형인가?

source: Is the type (α : Type) → (β : α → Type) → (a : α) → β a a dependent function type?
ko: 유형 (α : Type) → (β : α → Type) → (a : α) → β a는 의존 함수형인가?

source: Is the type (α : Type) → Prop a dependent function type?
ko: 유형 (α : Type) → Prop은 의존 함수형인가?

source: It has the same subdirectory structure as en.
ko: 하위 디렉터리 구조는 en과 똑같습니다.

source: It is used to refer to some or all of the following: the primary bearers of truth-value, the objects of belief and other “propositional attitudes” (i.e., what is believed, doubted, etc.), the referents of that-clauses, and the meanings of sentences.
ko: 이 용어는 다음 중 일부 또는 전부를 가리키는 데 쓰인다. 진릿값의 주요 담지자, 믿음이나 다른 ‘명제적 태도’의 대상(믿기는 것, 의심되는 것 등), that절의 지시 대상물, 문장의 의미.

source: It's my mailing list for end-user discussion and questions related to the lean-books project.
ko: 이는 lean-books 프로젝트와 관련된 최종 이용자들의 논의와 질문을 보관하는 한국어 메일링 리스트[전자 우편 수신자 목록]입니다.

source: Let Type.id be a function from Type to Type defined as follows:
ko: Type에서 Type으로의 함수 Type.id를 다음과 같이 정의하자.

source: Meaning: given p : Prop, the proposition ¬p stands for "It is not the case that p."
ko: 뜻: p : Prop가 주어져 있을 때, 명제 ¬p는 "p가 아니다."라는 뜻이다.

source: Meaning: given p q : Prop, the proposition p → q stands for "If p, then q."
ko: 뜻: p q : Prop가 주어져 있을 때, 명제 p → q는 "p이면 q이다."라는 뜻이다.

source: Meaning: given p q : Prop, the proposition p ↔ q stands for "p if and only if q" (often abbreviated as "p iff q").
ko: 뜻: p q : Prop가 주어져 있을 때, 명제 p ↔ q는 "p일 때 그리고 그럴 때만 q이다."(흔히 "p iff q"라고 축약함)라는 뜻이다.

source: Meaning: given p q : Prop, the proposition p ∧ q stands for "Both p and q."
ko: 뜻: p q : Prop가 주어져 있을 때, 명제 p ∧ q는 "p이고 q이다."라는 뜻이다.

source: Meaning: given p q : Prop, the proposition p ∨ q stands for "Either p or q."
ko: 뜻: p q : Prop가 주어져 있을 때, 명제 p ∨ q는 "p이거나 q이다."라는 뜻이다.

source: Meaning: given a type α and a unary predicate p : α → Prop, the proposition ∀ (x : α), p x stands for "For all x of type α, p x holds."
ko: 뜻: 유형 α와 단항 술어 p : α → Prop가 주어져 있을 때, 명제 ∀ (x : α), p x는 "유형 α에 속하는 모든 x에 대해, p x이다."라는 뜻이다.

source: Meaning: given a type α and a unary predicate p : α → Prop, the proposition ∃ (x : α), p x stands for "There exists a term x of type α where p x holds."
ko: 뜻: 유형 α와 단항 술어 p : α → Prop가 주어져 있을 때, 명제 ∃ (x : α), p x는 "유형 α에 속하고 p x를 성립시키는 항 x가 존재한다."라는 뜻이다.

source: Most of the content has been released under the terms of Apache License Version 2.0.
ko: 이 저작물의 대부분은 아파치 라이선스, 버전 2.0의 조건에 따라 배포됐습니다.

source: My Closing Thoughts
ko: 제 결론

source: Name in Lean: And
ko: 린에서의 이름: And

source: Name in Lean: Exists
ko: 린에서의 이름: Exists

source: Name in Lean: False
ko: 린에서의 이름: False

source: Name in Lean: Iff (abbreviation of "if and only if")
ko: 린에서의 이름: Iff ['…일 때 그리고 그럴 때만(if and only if)'의 준말]

source: Name in Lean: Not
ko: 린에서의 이름: Not

source: Name in Lean: Or
ko: 린에서의 이름: Or

source: Name in Lean: True
ko: 린에서의 이름: True

source: Name: existential quantifier
ko: 이름: 존재 정량어

source: Name: universal quantifier
ko: 이름: 보편 정량어

source: Names: conjunction, logical and
ko: 이름: 연언, 논리적 AND, 논리곱

source: Names: disjunction, logical or
ko: 이름: 선언(選言), 논리적 OR, 논리합

source: Names: equivalence, logical biconditional, material biconditional
ko: 이름: 동등, 논리적 쌍조건문, 내용적 쌍조건문

source: Names: equivalence, logical biconditional, material biconditional, material equivalence
ko: 이름: 동등, 논리적 쌍조건문, 내용적 쌍조건문, 내용적 동등

source: Names: falsity, false proposition, empty proposition
ko: 이름: 거짓, 거짓 명제

source: Names: implication, material implication, material conditional, logical conditional
ko: 이름: 함의, 내용적 함의, 내용적 조건문, 논리적 조건문

source: Names: negation, logical not
ko: 이름: 부정, 논리적 NOT

source: Names: truth, true proposition
ko: 이름: 참, 참 명제

source: Necessary condition: p → q also stands for "p only if q," that is, q is a necessary condition for p to be true.
ko: 필요조건: p → q는 "q일 때만 p이다."라는 뜻, 다시 말해 q는 p가 참이기 위한 필요조건이라는 뜻이다.

source: Negation
ko: 부정

source: Note that PProd.mk is the name of the constructor for PProd.
ko: PProd.mk가 PProd의 구성자의 이름임을 유념하라.

source: Note that PSigma.mk is the name of the constructor for PSigma.
ko: PSigma.mk가 PSigma의 구성자의 이름임을 유념하라.

source: Note that you can type the less-than-or-equal-to sign ≤ with \le.
ko: 작거나 같음 부호 ≤는 \le로 입력할 수 있음을 유념하라.

source: Notes on Implication
ko: 함의에 관한 첨언

source: On the contrary, it seems the authors of the entry "Propositions" in the Stanford Encyclopedia of Philosophy (SEP) would answer yes, judging from the following quotations:
ko: 이와 달리, 다음 인용문으로 미루어 보면 스탠퍼드 철학 백과사전(SEP) '명제' 항목의 저자들은 그렇다고 답할 듯합니다.

source: One can't clearly determine what the verb phrase 'clearly determine' really means, so Korean high school mathematics doesn't make it easier for students to understand the notion of a proposition.
ko: "명확하게 판별하다"라는 동사구가 무슨 뜻인지는 명확하게 판별할 수 없습니다. 그래서 한국 고등학교 수학에서의 명제 개념은 학생들이 이해하기 더 쉽지 않습니다.

source: One of them said that (b) is also a proposition since we can determine its truth or falsehood.
ko: 한 분은 우리가 (2)의 진릿값을 모르더라도 그것의 참과 거짓을 판별'할 수' 있기 때문에 이 또한 명제라고 말씀하셨습니다.

source: One of them told that (b) is also a proposition since we can determine its truth or falsehood.
ko: 한 분은 우리가 (2)의 진릿값을 모르더라도 그것의 참과 거짓을 판별'할 수' 있기 때문에 이 또한 명제라고 말씀하셨습니다.

source: Predicate Logic
ko: 술어 논리

source: Propositional Connectives
ko: 명제 연결사

source: Propositional Logic
ko: 명제 논리

source: Propositions
ko: 명제

source: Propositions in School Mathematics in South Korea
ko: 한국 학교 수학에서의 명제

source: Prove or disprove each of the following propositions about the constructors for the inductive type Foo defined above.
ko: 위에서 정의된 귀납형 Foo의 구성자들에 대한 다음 명제가 참임을 증명하거나 거짓임을 증명하라.

source: Prove the following example, replacing the sorry identifier with an actual proof:
ko: sorry 식별자를 실제 증명으로 바꿔 다음 보기를 증명하라.

source: Prove the following example:
ko: 다음 보기를 증명하라.

source: Prove the following examples, replacing each sorry identifier with an actual expression:
ko: sorry 식별자를 실제 식으로 바꿔 다음 보기를 증명하라.

source: Prove the following examples:
ko: 다음 보기를 증명하라.

source: Prove the following theorem, replacing the sorry identifier with an actual proof:
ko: sorry 식별자를 실제 증명으로 바꿔 다음 정리를 증명하라.

source: Prove the following theorem:
ko: 다음 정리를 증명하라.

source: Prove the following theorems:
ko: 다음 정리를 증명하라.

source: Quantifiers
ko: 정량어

source: Question 1
ko: 문제 1

source: Question 10
ko: 문제 10

source: Question 11
ko: 문제 11

source: Question 12
ko: 문제 12

source: Question 13
ko: 문제 13

source: Question 14
ko: 문제 14

source: Question 15
ko: 문제 15

source: Question 16
ko: 문제 16

source: Question 17
ko: 문제 17

source: Question 18
ko: 문제 18

source: Question 19
ko: 문제 19

source: Question 2
ko: 문제 2

source: Question 20
ko: 문제 20

source: Question 21
ko: 문제 21

source: Question 22
ko: 문제 22

source: Question 23
ko: 문제 23

source: Question 24
ko: 문제 24

source: Question 25
ko: 문제 25

source: Question 26
ko: 문제 26

source: Question 27
ko: 문제 27

source: Question 28
ko: 문제 28

source: Question 29
ko: 문제 29

source: Question 3
ko: 문제 3

source: Question 30
ko: 문제 30

source: Question 31
ko: 문제 31

source: Question 32
ko: 문제 32

source: Question 33
ko: 문제 33

source: Question 34
ko: 문제 34

source: Question 35
ko: 문제 35

source: Question 36
ko: 문제 36

source: Question 37
ko: 문제 37

source: Question 38
ko: 문제 38

source: Question 4
ko: 문제 4

source: Question 5
ko: 문제 5

source: Question 6
ko: 문제 6

source: Question 7
ko: 문제 7

source: Question 8
ko: 문제 8

source: Question 9
ko: 문제 9

source: Questions about Usages of the Term 'Proposition'
ko: '명제' 용어의 쓰임새에 관한 물음
